def spsk():
    spisok = 'АаБбВвГгДдЕеЁёЖжЗзИиЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщЪъЫыЬьЭэЮюЯяAaBbCcDdEeFfGgHhIiJjKkLlMmNnOoPpQq' \
                 'RrSsTtUuVvWwXxYyZz123456789()!?_-=+*/:., "'
    spisok_1 = ['д','т','б','п','г','к','дз','дж','ц','ч','щ','р',
                'х','м','н','л',"ф","й","в"]
    spisok_2 = ["а","о","у","ю","е","э","и","ы"]
    rule = ["мэ", "нари", "му","цу","ма","","","й","ка", "нага", "дама","д"]
    my_lists = [spisok_1, spisok_2, spisok, rule]

    return my_lists